In [1]:
import pandas as pd

In [3]:
df_exams = pd.read_csv('./StudentsPerformance.csv')
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

Math Operations

Math operations on columns

In [ ]:
#It returns the sum of the values in the math score column
df_exams['math score'].sum()

np.int64(66089)

In [6]:
df_exams.describe().round(2)

       math score  reading score  writing score
count     1000.00        1000.00        1000.00
mean        66.09          69.17          68.05
std         15.16          14.60          15.20
min          0.00          17.00          10.00
25%         57.00          59.00          57.75
50%         66.00          70.00          69.00
75%         77.00          79.00          79.00
max        100.00         100.00         100.00

Operations on rows

In [ ]:
average_sore = (df_exams['math score']+df_exams['reading score']+df_exams['writing score'])/3
df_exams['Avg'] = average_sore
df_exams.round(2)

In [12]:
import pandas as pd

# Sample DataFrame
df = pd.DataFrame({
    'Name': ['Sara', 'John', 'Adeel'],
    'Math': [88, 76, 95],
    'Science': [92, 85, 91],
    'English': [81, 73, 89]
})

print("Original DataFrame:")
print(df)

# 🧠 PRACTICE QUESTIONS:

# Q1: Create a new column 'Total' that adds 'Math' and 'Science' scores.
df['Total'] = df['Math']+df['Science']

# Q2: Create a column 'Average' that stores the average of 'Math', 'Science', and 'English'.
df['Average'] = ((df['Math']+df['Science'] + df['English'])/3).round(2)
# Q3: For each student (row), calculate the sum of all subject scores using axis=1.
df['Total_Marks'] = df['Math']+df['Science']+df['English']
df

Original DataFrame:
    Name  Math  Science  English
0   Sara    88       92       81
1   John    76       85       73
2  Adeel    95       91       89

    Name  Math  Science  English  Total  Average  Total_Marks
0   Sara    88       92       81    180    87.00          261
1   John    76       85       73    161    78.00          234
2  Adeel    95       91       89    186    91.67          275

Practing Axis in pandas

In [16]:
import pandas as pd

# Sample DataFrame for axis practice
df = pd.DataFrame({
    'A': [4, 7, 2],
    'B': [1, 8, 3],
    'C': [5, 9, 6]
})

print("Original DataFrame:")
print(df)

# 🔹 axis=0 → Column-wise (operate down each column)

# Q1: Find the maximum value in each column (use axis=0).
df.max(axis=0)
# Q2: Find the mean (average) of each column (use axis=0).
df.mean(axis=0)

# 🔹 axis=1 → Row-wise (operate across each row)

# Q3: Calculate the sum of values in each row (use axis=1).
df.sum(axis=1)
# Q4: Find the minimum value in each row (use axis=1).
df.min(axis=1)

Original DataFrame:
   A  B  C
0  4  1  5
1  7  8  9
2  2  3  6

0    1
1    7
2    2
dtype: int64